RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/api/lib/ExternalLoader/N25Q256A_STM32L476G-EVAL/Sources/Library_Files/stm32l4xx_quadspi.c
/**
  ******************************************************************************
  * @file    <stmxx>_<ppp>.c
  * @author  MCD Application Team
  * @version VX.Y.ZRCx
  * @date    DD-Month-YYYY
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the QUADSPI peripheral:
  *           < Add below the list of function groups (one group per line, copied
  *             from the header file) 
  *             Note: do not use "Peripheral" or "PPP" word in the function group name
  *           >
  *           +
  *           +
  *           +
  *           +
  *
  *  @verbatim
  *
================================================================================
          ##### <Product specific features/integration> #####
================================================================================
           
  [..] < This section can contain: 
       (#) Description of the product specific implementation; all features
           that is specific to this IP: separate clock for RTC/LCD/IWDG/ADC,
           power domain (backup domain for the RTC)...   
       (#) IP main features, only when needed and not mandatory for all IPs,
           ex. for xWDG, GPIO, COMP...
       >  
       
  [..] < You can add as much sections as needed.>
  
  [..] < You can add as much sections as needed.>
                 
   
            ##### How to use this driver #####
================================================================================
           [..]
           < 
            (#) Add below all needed steps to configure/use the peripheral and 
                its associated resources (clock, GPIO, DMA, IT...) 
                !!!THE STEPS SHOULD FOLLOW WHAT IS WRITTEN IN THE REFERENCE MANUAL!!!
                Basically, it should be the same as we provide in the examples.
                 
            (#) Exception can be made for system IPs (there is no standard order
                of API usage) for which the description of API usage will be made
                in each function group. These IPs are: PWR, RCC and FLASH
                In this case, this section should contain the following note:
                "Refer to the description within the different function groups below"
           >
  
            (+) 
  
            (+) 
  
            (+) 
  
            (+) 
  
            (+) 
  
            (+) 
  
    @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT YYYY STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_quadspi.h"
#include "stm32l4xx_rcc.h"
#include "stm32l4xx_conf.h" 
/** @addtogroup STM32L4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup QUADSPI
  * @brief QUADSPI driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define QUADSPI_CR_CLEAR_MASK                           0x00FFFFCF
#define QUADSPI_DCR_CLEAR_MASK                          0xFFE0F7FE
#define QUADSPI_CCR_CLEAR_MASK                          0x90800000
#define QUADSPI_PIR_CLEAR_MASK                          0xFFFF0000
#define QUADSPI_LPTR_CLEAR_MASK                         0xFFFF0000
#define QUADSPI_CCR_CLEAR_INSTRUCTION_MASK              0xFFFFFF00
#define QUADSPI_CCR_CLEAR_DCY_MASK                      0xFFC3FFFF
#define QUADSPI_CR_CLEAR_FIFOTHRESHOLD_MASK             0xFFFFF0FF
#define QUADSPI_CR_INTERRUPT_MASK                       0x001F0000
#define QUADSPI_SR_INTERRUPT_MASK                       0x0000001F

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/


/* Initialization and Configuration functions *********************************/

/** @defgroup <PPP>_Private_Functions 
  * @{
  */

/** @defgroup <PPP>_Group1 Function Group1 Name
 *  @brief   Function group1 name description (copied from the header file) 
 *
@verbatim  
 ===============================================================================
     ##### < Function group1 name (copied from the header file)
 Note: do not use "Peripheral" or "PPP" word in the function group name >  #####
 ===============================================================================

       [..] < OPTIONAL:
              Add here the most important information to know about the IP features
              covered by this group of function.
        
              For system IPs, this section contains how to use this group API.
            >

@endverbatim
  * @{
  */   

/**
  * @brief  Deinitializes the QUADSPI peripheral registers to their default
  *         reset values.
  * @param  None
  * @retval None
  */
void QUADSPI_DeInit(void)
{
    /* Enable QUADSPI reset state */
    RCC_AHB3PeriphResetCmd(RCC_AHB3Periph_QSPI, ENABLE);
    /* Release QUADSPI from reset state */
    RCC_AHB3PeriphResetCmd(RCC_AHB3Periph_QSPI, DISABLE);
}

/**
  * @brief  Fills each QUADSPI_InitStruct member with its default value.
  * @param  QUADSPI_InitStruct: pointer to a QUADSPI_InitTypeDef structure which will be initialized.
  * @retval None
  */
void QUADSPI_StructInit(QUADSPI_InitTypeDef* QUADSPI_InitStruct)
{
/*--------- Reset QUADSPI init structure parameters default values ------------*/
  /* Initialize the QUADSPI_SShift member */
  QUADSPI_InitStruct->QUADSPI_SShift = QUADSPI_SShift_NoShift ;
  /* Initialize the QUADSPI_Prescaler member */  
  QUADSPI_InitStruct->QUADSPI_Prescaler = 0 ;
  /* Initialize the QUADSPI_CKMode member */
  QUADSPI_InitStruct->QUADSPI_CKMode = QUADSPI_CKMode_Mode0 ;
  /* Initialize the QUADSPI_CSHTime member */
  QUADSPI_InitStruct->QUADSPI_CSHTime = QUADSPI_CSHTime_1Cycle ;
  /* Initialize the QUADSPI_FSize member */
  QUADSPI_InitStruct->QUADSPI_FSize = 0 ;
}

/**
  * @brief  Fills each QUADSPI_ComConfig_InitStruct member with its default value.
  * @param  QUADSPI_ComConfig_InitStruct: pointer to a QUADSPI_ComConfig_InitTypeDef structure which will be initialized.
  * @retval None
  */
void QUADSPI_ComConfig_StructInit(QUADSPI_ComConfig_InitTypeDef* QUADSPI_ComConfig_InitStruct)
{
/*--------- Reset QUADSPI ComConfig init structure parameters default values ------------*/
    
/* Set QUADSPI Communication configuration structure parameters default values */
  /* Initialize the QUADSPI_ComConfig_DDRMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DDRMode = QUADSPI_ComConfig_DDRMode_Disable ;
  /* Initialize the QUADSPI_ComConfig_SIOOMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_SIOOMode = QUADSPI_ComConfig_SIOOMode_Disable ;
  /* Initialize the QUADSPI_ComConfig_FMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_FMode = QUADSPI_ComConfig_FMode_Indirect_Write ;
  /* Initialize the QUADSPI_ComConfig_DMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DMode = QUADSPI_ComConfig_DMode_NoData ;
  /* Initialize the QUADSPI_ComConfig_DummyCycles member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_DummyCycles = 0 ;
  /* Initialize the QUADSPI_ComConfig_ABSize member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABSize = QUADSPI_ComConfig_ABSize_8bit ;
  /* Initialize the QUADSPI_ComConfig_ABMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ABMode = QUADSPI_ComConfig_ABMode_NoAlternateByte ;
  /* Initialize the QUADSPI_ComConfig_ADSize member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADSize = QUADSPI_ComConfig_ADSize_8bit ;
  /* Initialize the QUADSPI_ComConfig_ADMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_ADMode = QUADSPI_ComConfig_ADMode_NoAddress ;
  /* Initialize the QUADSPI_ComConfig_IMode member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_IMode = QUADSPI_ComConfig_IMode_NoInstruction ;
  /* Initialize the QUADSPI_ComConfig_Ins member */
  QUADSPI_ComConfig_InitStruct->QUADSPI_ComConfig_Ins = 0 ;  
}

/**
  * @brief  Initializes the QUADSPI peripheral according to the specified 
  *         parameters in the QUADSPI_InitStruct.
  * @param  QUADSPI_InitStruct: pointer to a QUADSPI_InitTypeDef structure that
  *         contains the configuration information for the specified QUADSPI peripheral.
  * @retval None
  */
void QUADSPI_Init(QUADSPI_InitTypeDef* QUADSPI_InitStruct)
{
  uint32_t tmpreg = 0;
  
  /* Check the QUADSPI parameters */
  assert_param(IS_QUADSPI_SSHIFT(QUADSPI_InitStruct->QUADSPI_SShift));
  assert_param(IS_QUADSPI_PRESCALER(QUADSPI_InitStruct->QUADSPI_Prescaler));
  assert_param(IS_QUADSPI_CKMODE(QUADSPI_InitStruct->QUADSPI_CKMode));
  assert_param(IS_QUADSPI_CSHTIME(QUADSPI_InitStruct->QUADSPI_CSHTime));
  assert_param(IS_QUADSPI_FSIZE(QUADSPI_InitStruct->QUADSPI_FSize));
  
  /*------------------------ QUADSPI CR Configuration ------------------------*/
  /* Get the QUADSPI CR1 value */
  tmpreg = QUADSPI->CR;
  /* Clear PRESCALER and SSHIFT bits */
  tmpreg &= QUADSPI_CR_CLEAR_MASK;
  /* Configure QUADSPI: Prescaler and Sample Shift */
  tmpreg |= (uint32_t)(((QUADSPI_InitStruct->QUADSPI_Prescaler)<<24)
                        |(QUADSPI_InitStruct->QUADSPI_SShift));  
  /* Write to QUADSPI CR */
  QUADSPI->CR = tmpreg;
  
  /*------------------------ QUADSPI DCR Configuration ------------------------*/
  /* Get the QUADSPI DCR value */
  tmpreg = QUADSPI->DCR;
  /* Clear FSIZE, CSHT and CKMODE bits */
  tmpreg &= QUADSPI_DCR_CLEAR_MASK;
  /* Configure QUADSPI: Flash Size, Chip Select High Time and Clock Mode */
  tmpreg |= (uint32_t)(((QUADSPI_InitStruct->QUADSPI_FSize)<<16)
                        |(QUADSPI_InitStruct->QUADSPI_CSHTime)
                        |(QUADSPI_InitStruct->QUADSPI_CKMode));  
  /* Write to QUADSPI DCR */
  QUADSPI->DCR = tmpreg;  
}

/**
  * @brief  Initializes the QUADSPI CCR according to the specified 
  *         parameters in the QUADSPI_ComConfig_InitStruct.
  * @param  QUADSPI_ComConfig_InitStruct: pointer to a QUADSPI_ComConfig_InitTypeDef structure that
  *         contains the communiction configuration informations about QUADSPI peripheral.
  * @retval None
  */
void QUADSPI_ComConfig_Init(QUADSPI_ComConfig_InitTypeDef* QUADSPI_ComConfig_InitStruct)
{
  uint32_t tmpreg = 0;

